try:
    cl_1 = int(input("Введіть число учнів в першому математичному класі: "))
    cl_2 = int(input("Введіть число учнів в другому математичному класі: "))
    cl_3 = int(input("Введіть число учнів в третьому математичному класі: "))
    if cl_1 >= 0 and cl_2 >= 0 and cl_3 >= 0:
        table_1 = cl_1 // 2 if cl_1 % 2 == 0 else cl_1 // 2 + 1
        table_2 = cl_2 // 2 if cl_2 % 2 == 0 else cl_2 // 2 + 1
        table_3 = cl_3 // 2 if cl_3 % 2 == 0 else cl_3 // 2 + 1
        print("Потрібно закупити", table_1 + table_2 + table_3, "парт")
    else:
        print("Кількість учнів не може бути від'ємною")
except ValueError:
    print("Введено не коректне значення")
