str_ = input("Введіть рядок більше 15 символів ")
while len(str_) <= 15:
    print("Довжина рядка менше 15 символів. Введіть рядок більше 15 символів ")
    str_ = input("Введіть рядок більше 15 символів ")
print("a. третій символ:", str_[2])
print("b. передостанній символ:", str_[-2])
print("c. перші п'ять символів:", str_[:5])
print("d. рядок, окрім двох останніх символів:", str_[:-2])
print("e. символи з парними індексами:", str_[2::2])
print("f. символи з непарними індексами:", str_[1::2])
print("g. зворотній напрямок:", str_[::-1])
print("h. зворотній напрямок через один:", str_[-1::-2])
print("i. довжина рядка:", len(str_))

